app/controllers/sessions_controller.rb

  def create
    auth_hash = request.env['omniauth.auth']

    @authorization = Authorization.find_by_provider_and_uid(auth_hash["provider"], auth_hash["uid"])
---
SELECT  "authorizations".* FROM "authorizations" WHERE "authorizations"."provider" = ? AND "authorizations"."uid" = ? LIMIT 1  [["provider", "fitbit"], ["uid", "37W58D"]]